{"categories":[
	{"vegan": [
		{
			"recipe_name": "Vegan Chilli",
			"ingredients": [
				"1 (12 ounce) package vegetarian burger crumbles",
				"1 (15 ounce) can tomato sauce",
				"1 cup water",
				"1 small onion, chopped",
				"3 cloves garlic, minced",
				"1 tablespoon vegetarian Worcestershire sauce",
				"1 teaspoon liquid smoke flavoring",
				"2 teaspoons chili powder",
				"1/8 teaspoon black pepper",
				"1 teaspoon dry mustard",
				"1 teaspoon salt",
				"1/8 teaspoon red pepper flakes"
			],
			"directions": "In a large pot combine crumbles, tomato sauce, water, onion, garlic, Worcestershire sauce, liquid smoke, chili powder, black pepper, mustard, salt and pepper flakes. Cook on low heat for 30 minutes, or until heated through."
		},

		{
			"recipe_name": "Mushroom Burgers",
			"ingredients": [
				"4 portobello mushroom caps",
				"1/4 cup balsamic vinegar",
				"2 tablespoons olive oil",
				"1 teaspoon dried basil",
				"1 teaspoon dried oregano",
				"1 tablespoon minced garlic",
				"salt and pepper to taste",
				"4 (1 ounce) slices provolone cheese"
			],
			"directions": "Place the mushroom caps, smooth side up, in a shallow dish. In a small bowl, whisk together vinegar, oil, basil, oregano, garlic, salt, and pepper. Pour over the mushrooms. Let stand at room temperature for 15 minutes or so, turning twice. Preheat grill for medium-high heat. Brush grate with oil. Place mushrooms on the grill, reserving marinade for basting. Grill for 5 to 8 minutes on each side, or until tender. Brush with marinade frequently. Top with cheese during the last 2 minutes of grilling."
		},
		
		{
			"recipe_name": "Lasagne",
			"ingredients": [
				"2 tablespoons olive oil",
				"1 1/2 cups chopped onion",
				"3 tablespoons minced garlic",
				"4 (14.5 ounce) cans stewed tomatoes",
				"1/3 cup tomato paste",
				"1/2 cup chopped fresh basil",
				"1/2 cup chopped parsley",
				"1 teaspoon salt",
				"1 teaspoon ground black pepper",
				"1 (16 ounce) package lasagna noodles",
				"2 pounds firm tofu",
				"2 tablespoons minced garlic",
				"1/4 cup chopped fresh basil",
				"1/4 cup chopped parsley",
				"1/2 teaspoon salt",
				"ground black pepper to taste",
				"3 (10 ounce) packages frozen chopped spinach, thawed and drained"
			],
			"directions": "Make the sauce: In a large, heavy saucepan, over medium heat, heat the olive oil. Place the onions in the saucepan and saute them until they are soft, about 5 minutes. Add the garlic; cook 5 minutes more. Place the tomatoes, tomato paste, basil and parsley in the saucepan. Stir well, turn the heat to low and let the sauce simmer covered for 1 hour. Add the salt and pepper. While the sauce is cooking bring a large kettle of salted water to a boil. Boil the lasagna noodles for 9 minutes, then drain and rinse well. Preheat the oven to 400 degrees F (200 degrees C). Place the tofu blocks in a large bowl. Add the garlic, basil and parsley. Add the salt and pepper, and mash all the ingredients together by squeezing pieces of tofu through your fingers. Mix well. Assemble the lasagna: Spread 1 cup of the tomato sauce in the bottom of a 9x13 inch casserole pan. Arrange a single layer of lasagna noodles, sprinkle one-third of the tofu mixture over the noodles. Distribute the spinach evenly over the tofu. Next ladle 1 1/2 cups tomato sauce over the tofu, and top it with another layer of the noodles. Then sprinkle another 1/3 of the tofu mixture over the noodles, top the tofu with 1 1/2 cups tomato sauce, and place a final layer of noodles over the tomato sauce. Finally, top the noodles with the final 1/3 of the tofu, and spread the remaining tomato sauce over everything. Cover the pan with foil and bake the lasagna for 30 minutes. Serve hot and enjoy."
		},
		
		{
			"recipe_name": "Brownies",
			"ingredients": [
				"2 cups unbleached all-purpose flour",
				"2 cups white sugar",
				"3/4 cup unsweetened cocoa powder",
				"1 teaspoon baking powder",
				"1 teaspoon salt",
				"1 cup water",
				"1 cup vegetable oil",
				"1 teaspoon vanilla extract"
			],
			"directions": "Preheat the oven to 350 degrees F (175 degrees C). In a large bowl, stir together the flour, sugar, cocoa powder, baking powder and salt. Pour in water, vegetable oil and vanilla; mix until well blended. Spread evenly in a 9x13 inch baking pan. Bake for 25 to 30 minutes in the preheated oven, until the top is no longer shiny. Let cool for at least 10 minutes before cutting into squares."
		},
		
		{
			"recipe_name": "Falafel Burgers",
			"ingredients": [
				"2 tablespoons olive oil, divided",
				"1 small red onion, chopped",
				"1 large garlic clove, minced",
				"1 (16 ounce) can garbanzo beans (chickpeas), drained and rinsed",
				"1 (7.75 ounce) can spinach, well drained",
				"1 tablespoon lemon juice",
				"1/2 teaspoon salt",
				"1/4 cup dry breadcrumbs"
			],
			"directions": "In 12-inch skillet over medium heat, in 1 tablespoon hot olive oil, cook red onion and garlic about 5 minutes until tender-crisp. To food processor, add one-fourth of garbanzo beans, lemon juice and salt; pulse canned spinach until mixture is a smooth paste. Add remaining garbanzo beans, breadcrumbs and onion mixture; pulse until coarsely chopped. Shape mixture into four 4-inch patties. (If desired, you can refrigerate until ready to cook.) In 12-inch skillet over medium heat, in remaining tablespoon hot olive oil, cook falafel patties until golden and crisp, turning once. Serve with any of the above serving suggestions."
		},
		
		{
			"recipe_name": "Thai Curry",
			"ingredients": [
				"1 sweet potato, peeled and cubed",
				"1 medium eggplant, cubed",
				"1 green bell pepper, chopped",
				"1 red bell pepper, chopped",
				"2 carrots, chopped",
				"1 onion, chopped",
				"6 tablespoons olive oil",
				"3 cloves garlic, minced",
				"1 teaspoon ground turmeric",
				"1 tablespoon curry powder",
				"1 teaspoon ground cinnamon",
				"3/4 tablespoon sea salt",
				"3/4 teaspoon cayenne pepper",
				"1 (15 ounce) can garbanzo beans, drained",
				"1/4 cup blanched almonds",
				"1 zucchini, sliced",
				"2 tablespoons raisins",
				"1 cup orange juice",
				"10 ounces spinach"
			],
			"directions": "In a large Dutch oven place sweet potato, eggplant, peppers, carrots, onion, and three tablespoons oil. Saute over medium heat for 5 minutes. In a medium saucepan place 3 tablespoons olive oil, garlic, turmeric, curry powder, cinnamon, salt and pepper and saute over medium heat for 3 minutes. Pour garlic and spice mixture into the Dutch oven with vegetables in it. Add the garbanzo beans, almonds, zucchini, raisins, and orange juice. Simmer 20 minutes, covered. Add spinach to pot and cook for 5 more minutes. Serve!"
		}
	]},

	{"healthy": [
		{
			"recipe_name": "Roasted Chickpea Wraps",
			"ingredients": [
				"3 cups chickpeas drained and rinsed",
				"1/4 cup hot sauce",
				"1/4 teaspoon salt",
				"1/2 teaspoon oregano",
				"1/4 teaspoon paprika",
				"1/8 teaspoon garlic powder",
				"1 tablespoon olive oil",
				"1/4 cup minced cilantro leaves",
				"6 large tortillas (any flavor you prefer)",
				"6 teaspoons Green Habanero Sauce or any hot sauce",
				"2 cups purple kale chopped",
				"2 avocados sliced",
				"3 radishes sliced",
				"3 scallions chopped",
				"1 lemon"
			],
			"directions": "Preheat the oven to 425 degrees. In a large bowl add all the chickpea ingredients except for the cilantro. Toss well to coat and spread the chickpeas in a single layer on a baking sheet (lined with parchment paper). Roast the chickpeas for 25 minutes (stirring frequently to make sure they roast evenly). Once the chickpeas are done, allow them to cool slightly before starting the wraps. Place a tortilla on a flat surface and spread with the hot sauce, add the kale along the centre of the tortilla. Pile the remaining toppings over the kale along the centre of the tortilla too, leaving an inch clearance on the both sides. gently fold the sides of the tortillas over the filling before you tart rolling (that way the filling doesn't fall off the wrap), and then start rolling the tortillas. Slice each wrap in half and serve! Enjoy :)"
		},

		{
			"recipe_name": "Roast Pepper Pesto Pasta",
			"ingredients": [
				"16 ounce jar roasted red peppers (or use 3-4 fresh roasted peppers)",
				"1/4 cup packed fresh basil leaves (10-15 leaves)",
				"2 cloves garlic, peeled",
				"1/2 cup parmesan cheese",
				"1/2 cup finely chopped walnuts",
				"1/4 cup olive oil",
				"16 ounce package DaLallo Organic Whole Grain Pasta, any variety",
				"Salt and pepper"
			],
			"directions": "Bring a large pot of salted water to a boil. Boil the pasta according to the DeLallo package instructions, approximately 10-12 minutes. Drain the pasta and pour back in the pot. While the pasta is cooking, chop the walnuts in a food processor. Pour the walnuts into a small bowl then add the roasted red peppers, fresh basil, and garlic to the food processor. Pulse until finely chopped. Add the parmesan cheese, chopped walnuts, olive oil, and 1/2 tsp. salt to the food processor, Pulse to combine. Salt and Pepper to taste. Pour the pesto over the cooked and drained pasta and toss to coat. Serve warm."
		},

		{
			"recipe_name": "Veggie Wholewheat Pot Noodle",
			"ingredients": [
				"100g dried wholewheat noodles",
				"2 tsp groundnut oil",
				"1 red pepper, cut into fine strips",
				"large courgette, cut into matchsticks",
				"50g frozen shelled edamame beans",
				"25g beansprouts",
				"1 carrot, peeled and cut into matchsticks",
				"handful baby spinach",
				"2-4 tbsp crispy onions from a tub",
				"2 tbsp roughly chopped coriander",
				"1 tbsp sesame oil",
				"2 tbsp Yuzu juice (or 2 limes, juiced)",
				"1 garlic clove, finely chopped",
				"1 red chilli, deseeded and finely chopped",
				"1 tsp grated ginger"
			],
			"directions": "Fill a large saucepan with water and bring to the boil. Add the noodles and cook for 3-5 mins or until tender. Drain and leave to cool. Place a large non-stick pan (or wok) over a medium-high heat and add the groundnut oil. When hot, add the red pepper and cook for 2-3 mins until slightly softened. Add the courgette and edamame, and cook for a further 1-2 mins. Remove from the heat, transfer to a bowl and allow to cool. Whisk together the dressing ingredients in a small bowl, or 2 jars if taking to work, then season. Divide the noodles between 2 jars or plastic containers and top with the cooled vegetables, beansprouts, carrot, spinach, crispy onions and coriander. Add the dressing just before eating."
		},

		{
			"recipe_name": "Lean Turkey Burger",
			"ingredients": [
				"2 lb organic lean ground turkey",
				"1/3 cup bell pepper any color, diced",
				"1/3 cup red or yellow onion diced",
				"2 tbsp green onion chopped",
				"1 cup chopped spinach",
				"1/4 cup sundried tomato chopped",
				"1/4 cup organic crumbled feta cheese",
				"1-2 tbsp fennel seed",
				"2 tbsp oregano tomato basil or Italian seasoning",
				"Sea salt/pepper to taste",
				"1/2 tbsp minced garlic",
				"2 tbsp olive oil",
				"2 tbsp low sodium chicken broth"
			],
			"directions": "(Can choose to saute chopped bell peppers, onion and sundried tomato in 1 tsp olive oil prior to mixing with rest of ingredients for added flavor). Mix all ingredients together (excluding oil and chicken broth) in large bowl and form into patties. Place patties on a flat top, grill or in a skillet with olive oil on medium heat. Let cook until they have browned on either side (about 4-5 minutes). *If patties are thick and taking longer to cook then add chicken broth to pan and cover with lid to let steam on lower heat, OR put in the oven at 350 degrees F for about 5 minutes. Store in an air-tight container and refrigerate up to 5 days or store in freezer for later use."
		},

		{
			"recipe_name": "Thai Prawn and Ginger Noodles",
			"ingredients": [
				"100g folded rice noodles (sen lek)",
				"zest and juice 1 small orange",
				"1-2 tbsp red curry paste",
				"1-2 tsp fish sauce",
				"2 tsp light brown soft sugar",
				"1 tbsp sunflower oil",
				"25g ginger, scraped and shredded",
				"2 large garlic cloves, sliced",
				"1 red pepper, deseeded and sliced",
				"85g sugar snap peas, halved lengthways",
				"140g beansprouts",
				"175g pack raw king prawns",
				"handful chopped basil",
				"handful chopped coriander"
			],
			"directions": "Put the noodles in a bowl and pour over boiling water to cover them. Set aside to soak for 10 mins. Stir together the orange juice and zest, curry paste, fish sauce, sugar and 3 tbsp water to make a sauce. Heat the oil in a large wok and add half the ginger and the garlic. Cook, stirring, for 1 min. Add the pepper and stir-fry for 3 mins more. Toss in the sugar snaps, cook briefly, then pour in the curry sauce. Add the beansprouts and prawns, and continue cooking until the prawns just turn pink. Drain the noodles, then toss these into the pan with the herbs and remaining ginger. Mix until the noodles are well coated in the sauce, then serve."
		},

		{
			"recipe_name": "Overnight Oats",
			"ingredients": [
				"1 cup Almond Breeze Vanilla almondmilk",
				"1/2 mashed banana",
				"1/2 cup rolled oats",
				"1 tablespoon chia seeds"
			],
			"directions": "In pint jar with lid, place all ingredients and shake. Cover; refrigerate at least 8 hours or overnight."
		}
	]},

	{"brunch": [
		{
			"recipe_name": "Huevos Rancheros",
			"ingredients": [
				"2 tablespoons vegetable oil",
				"4 (6 inch) corn tortillas",
				"1 cup refried beans with green chilies",
				"1 teaspoon butter",
				"4 eggs",
				"1 cup shredded Cheddar cheese",
				"8 slices bacon, cooked and crumbled",
				"1/2 cup salsa (optional)"
			],
			"directions": "Heat oil in a small skillet over medium-high heat. Fry tortillas one at a time until firm, but not crisp. Remove to paper towels to drain grease. Meanwhile, combine the refried beans and butter in a microwave-safe dish. Cover, and cook in the microwave until heated through. When tortillas are done, fry eggs over easy in the skillet. Add more oil if the tortillas have absorbed it all. Place tortillas onto plates, and spread a layer of beans on them. Top with cheese, a fried egg, crumbled bacon and if desired, salsa."
		},

		{
			"recipe_name": "Eggs Royale",
			"ingredients": [
				"200g hollandaise sauce",
				"1 pinch salt",
				"2 muffins, split",
				"2 tsp white wine vinegar",
				"4 medium eggs",
				"150g smoked salmon, thinly sliced"
			],
			"directions": "Fill a frying pan with about 5cm of water, add the vinegar and salt and bring to the boil. Adjust the heat so the water is boiling but not too fiercely then crack an egg into a cup and tip into the pan. Repeat with the remaining eggs, working quickly and remembering the order in which you put them in. Cook for 3-5 minutes depending on how you like your eggs cooked. While the eggs are cooking toast the muffin and then top with slices of smoked salmon. Remove the eggs from the pan with a slotted spoon and drain on kitchen paper before placing on top of the smoked salmon. Spoon over the Hollandaise sauce to serve."
		},

		{
			"recipe_name": "French Toast with Maple Syrup",
			"ingredients": [
				"6 thick slices bread",
				"2 eggs",
				"2/3 cup milk",
				"1/4 teaspoon ground cinnamon (optional)",
				"1/4 teaspoon ground nutmeg (optional)",
				"1 teaspoon vanilla extract (optional)",
				"salt to taste"
			],
			"directions": "Beat together egg, milk, salt, desired spices and vanilla. Heat a lightly oiled griddle or skillet over medium-high heat. Dunk each slice of bread in egg mixture, soaking both sides. Place in pan, and cook on both sides until golden. Serve hot."
		},

		{
			"recipe_name": "Pancakes with Fresh Berries",
			"ingredients": [
				"1 3/4 cups all purpose flour",
				"2 teaspoons baking powder",
				"1/4 teaspoon salt",
				"1 tablespoon sugar",
				"2 large eggs",
				"1 1/4 cups whole milk",
				"4 tablespoons unsalted butter, melted",
				"1 cup blueberries, fresh or frozen (thawed if frozen)",
				"vegetable oil, for the pan"
			],
			"directions": "In a medium-size mixing bowl, whisk together all your dry ingredients In a separate bowl, whisk together all of the wet ingredients until the egg is broken up. Add the wet ingredients to the dry ingredients and add the blueberries. Gently stir until you stop seeing flour. Be careful not to overmix, that will make the batter tough. Leave a few lumps for tender pancakes. Place your a large non-stick pan over a medium-high flame and let the surface get hot. It's hot enough when you sprinkle a few droplets of water over the surface and they evaporate. Moisten a paper towel with vegetable oil and lightly wipe the bottom of the pan. This will keep the pancakes from sticking. For each pancake, gently pour 1/2 cup of batter into the pan, using a ladle or a measuring cup. Use the back of a spoon to spread the batter into a circle. Bubbles will form in the batter. When they begin to pop, the pancakes are ready to be flipped. Turn over gently with the spatula and cook for about one minute on the flip side."
		},

		{
			"recipe_name": "Berry Smoothie Bowl",
			"ingredients": [
				"1 cup frozen strawberries",
				"1 cup frozen pineapple chunks",
				"1 cup plain Greek yogurt",
				"1/2 cup coconut water",
				"2 tablespoons frozen acai berry pulp, or as desired",
				"1 kiwi, peeled and sliced",
				"1/2 banana, sliced",
				"1/2 cup fresh blueberries",
				"1/2 cup fresh raspberries",
				"2 tablespoons sliced almonds",
				"2 tablespoons granola",
				"1 teaspoon chia seeds (optional)"
			],
			"directions": "Blend strawberries, pineapple, yogurt, coconut water, and acai pulp in a blender until smooth; pour into a bowl. Top smoothie with kiwi, banana, blueberries, raspberries, almonds, granola, and chia seeds."
		},

		{
			"recipe_name": "Baked Avocado with Smoked Salmon and Egg",
			"ingredients": [
				"avocado 3 large",
				"eggs 6 small, separated",
				"smoked salmon 3 slices, cut into pieces",
				"chives finely chopped to make 1 tbsp",
				"cayenne peppe r a pinch (optional)",
				"toasted dark rye bread to serve"
			],
			"directions": "Heat the oven to 200C/fan 180C/gas 6. Halve the avocados lengthways and remove their stones. Cut a small slice off the skin-side of the avocado halves to stop them rolling and put them onto a baking tray. Scoop out some of the middle from where the stone was, add a little salmon to each and then add the egg yolks. Beat the egg whites quickly, so it's one uniform consistency, and pour in as much as you can. Grind over black pepper and bake for 10 minutes, or until the whites have set. Scatter over the chives and a pinch of cayenne, if you like. Serve with rye soldiers for dunking."
		}
	]},

	{"mexican": [
		{
			"recipe_name": "Pulled Pork Burrito",
			"ingredients": [
				"4 burrito-size tortillas",
				"1 pound pulled pork",
				"2 tablespoons BBQ Sauce (only use if pulled pork doesn't already have sauce mixed in)",
				"1 cup shredded cheddar or Mexican cheese blend",
				"1 1/3 cups cooked Mexican rice",
				"1 tablespoon butter",
				"2 tablespoons olive oil",
				"1/3 cup finely diced yellow or sweet onion",
				"3 tablespoons flour",
				"1 (14.5-ounce) can chicken broth",
				"1/2 (4-ounce) can green chilies",
				"1/2 teaspoon cumin",
				"1/2 teaspoon garlic powder",
				"1/4 teaspoon salt",
				"1/2 cup sour cream",
				"1/2 cup shredded cheddar or Mexican cheese blend",
				"chopped fresh cilantro and salsa, optional"
			],
			"directions": "Preheat oven to 400 degrees and spray a baking sheet with cooking spray. Place tortillas on a microwave-safe plate and lay a damp paper towel on top. Microwave for 30 seconds. (This will make them more pliable.) Mix BBQ sauce with pulled pork. Divide pulled pork, rice, and cheese evenly between tortillas and roll up burrito style. Place on prepared baking sheet and spray each burrito with cooking spray to help the tortilla crisp up. Place in oven for 20 minutes. While burritos are in the oven, heat butter and olive oil over medium heat in a medium saucepan. Add onion and cook until soft. Sprinkle flour into saucepan. Stir and cook for 1 minute. Sprinkle flour into saucepan. Stir and cook for 1 minute. Gradually whisk in chicken broth. Add green chilies, cumin, garlic powder, and salt and simmer 2 to 3 minutes to thicken. Keep warm and stir in sour cream and cheese just before ready to serve. Spoon sauce over burritos. Sprinkle with fresh cilantro and add some salsa if desired."
		},

		{
			"recipe_name": "Chicken Fajitas",
			"ingredients": [
				"1 Reynolds(R) Slow Cooker Liner",
				"2 pounds boneless, skinless chicken breast tenders",
				"1 medium onion, thinly sliced",
				"1 large red bell pepper, cut into thin strips",
				"1 large green bell pepper, cut into thin strips",
				"3/4 cup chunky salsa",
				"2 (1.4 ounce) packages fajita seasoning mix",
				"1/4 teaspoon cayenne pepper",
				"16 (10 inch) flour tortillas",
				"Shredded cheese",
				"Chopped tomatoes",
				"Guacamole",
				"Sour cream"
			],
			"directions": "Open Reynolds(R) Slow Cooker Liner and place it inside a 5- to 6 1/2-quart slow cooker bowl. Fit liner snugly against the bottom and sides of bowl; pull top of liner over rim of bowl. Place chicken in Reynolds(R) Slow Cooker Liner. Place onions and bell peppers on top of chicken. Mix salsa, fajita seasoning mix and cayenne pepper in a medium bowl. Pour over chicken. Place lid on slow cooker. Cook on LOW for 6 to 7 hours OR on HIGH for 3 to 4 hours until chicken is done. Carefully remove lid to allow steam to escape. Gently stir chicken and sauce with a plastic or wooden slotted spoon. Spoon 1/2 cup of chicken mixture into center of each tortilla; add desired toppings and fold tortilla over filling. Do not lift or transport liner with food inside. Cool slow cooker completely; remove Reynolds(R) Slow Cooker Liner and toss."
		},

		{
			"recipe_name": "Vegetable Enchiladas",
			"ingredients": [
				"3 tablespoons olive oil",
				"1 tablespoon ground cumin",
				"2 teaspoons adobo seasoning",
				"1/2 teaspoon garlic powder",
				"1/2 teaspoon white pepper",
				"1/4 teaspoon ground coriander",
				"1/4 teaspoon black pepper",
				"1/4 cup all purpose flour",
				"6 oz can tomato paste",
				"3 cups vegetable broth",
				"2 tablespoons olive oil",
				"2 cloves garlic, minced",
				"1 large yellow onion, diced",
				"1 large bell pepper (yellow, orange or red), diced",
				"2 cups fresh (or frozen) corn",
				"1 teaspoon adobo seasoning",
				"1/4 teaspoon cumin",
				"1 (15 oz) can black beans, rinsed and drained",
				"1 6 oz bag fresh baby spinach",
				"1/2 cup cilantro, chopped",
				"16 oz fiesta blend cheese",
				"16 (6 inch) corn tortillas"
			],
			"directions": "In a medium saucepan, heat olive oil over medium-high heat. Add cumin, adobo, garlic powder, white pepper, coriander, black pepper, flour, and tomato paste. Cook, whisking constantly, for 1 minute. Whisk in the broth and bring to a boil. Reduce to a simmer and cook until slightly thickened, about 5 minutes. Set aside. In a large skillet, heat olive oil over medium-high heat. Add garlic, onion, bell pepper and corn and saute until just softened. Stir in adobo, cumin and black beans. Add spinach and saute until wilted, about 2 minutes. Remove pan from heat. Stir in cilantro and 2 cups of cheese. Preheat oven to 375F. Lightly spray a 9x13 baking dish with non-stick spray. Pour 3/4 cup sauce in the bottom of the baking dish and spread evenly. Wrap corn tortillas in a damp paper towel and microwave for 30 seconds. Then working quickly, spoon about 1/3 c of the enchilada filling into each tortilla and roll up. Place in the baking dish, seam side down. Pack the filled tortillas tightly in the baking dish. Pour remaining sauce over them, making sure to cover the entire surface. Sprinkle remaining cheese evenly over the enchiladas. Bake uncovered until hot and bubbly, about 20 minutes. Cool for 5 minutes before serving and sprinkle with extra cilantro. Serve hot!"
		},

		{
			"recipe_name": "Spicy Beef Quesadillas",
			"ingredients": [
				"2 tablespoons butter",
				"1 medium yellow or sweet onion, chopped",
				"1 green bell pepper, chopped",
				"2 chipotle chile peppers in adobo sauce, finely chopped",
				"1/2 teaspoon crushed red pepper flakes",
				"1/2 teaspoon smoked paprika",
				"salt and pepper",
				"2 cups leftover Shredded Beef Short Ribs or Brisket",
				"8 (8-inch) flour tortillas",
				"2 cups shredded Mexican cheese",
				"2 tablespoons butter"
			],
			"directions": "Melt butter over medium-high heat in a large pan. Add onion and bell pepper and cook until they are starting to soften but still have a little crunch. Add chipotle peppers, red pepper flakes, paprika and season to taste with salt and pepper. Stir leftover short ribs into onion mixture and transfer to a bowl. Wipe pan clean. For each quesadilla, sprinkle about 1/4 cup cheese on a tortilla, top with 1/4 of short rib/onion mixture, and cover with another 1/4 cup cheese. Place a second tortilla on top. Melt about a 1/2 tablespoon butter in the pan, add quesadilla and cook until golden brown on each side and cheese is melted. Repeat for remaining 3 quesadillas."
		},

		{
			"recipe_name": "Chilli Con Carne",
			"ingredients": [
				"6 pounds dried pinto beans",
				"3/8 cup salt",
				"20 pounds lean ground beef",
				"1 pound chopped onions",
				"4 cloves garlic, minced",
				"6 quarts canned peeled and diced tomatoes",
				"2 quarts tomato paste",
				"1 1/3 cups chili powder",
				"3 tablespoons ground cumin",
				"1 1/2 teaspoons ground black pepper"
			],
			"directions": "Wash and sort pinto beans. Bring 3 gallons of water to boil in a 6 gallon pot. Pour in beans, return to a boil and cook 2 minutes. Remove from heat and let stand 1 hour. Stir in salt and simmer until tender, 90 minutes. Drain and set aside. Brown beef with onions and garlic over medium high heat in same pot or enormous skillet. Combine meat mixture, tomatoes, tomato paste, chili powder, cumin, pepper and cooked beans in 6 gallon pot; stir; cover and simmer 1 hour."
		},

		{
			"recipe_name": "Churros",
			"ingredients": [
				"1 cup water",
				"2 1/2 tablespoons white sugar",
				"1/2 teaspoon salt",
				"2 tablespoons vegetable oil",
				"1 cup all-purpose flour",
				"2 quarts oil for frying",
				"1/2 cup white sugar, or to taste",
				"1 teaspoon ground cinnamon"
			],
			"directions": "In a small saucepan over medium heat, combine water, 2 1/2 tablespoons sugar, salt and 2 tablespoons vegetable oil. Bring to a boil and remove from heat. Stir in flour until mixture forms a ball. Heat oil for frying in deep-fryer or deep skillet to 375 degrees F (190 degrees C). Pipe strips of dough into hot oil using a pastry bag. Fry until golden; drain on paper towels. Combine 1/2 cup sugar and cinnamon. Roll drained churros in cinnamon and sugar mixture."
		},

		{
			"recipe_name": "Jackfruit Tacos",
			"ingredients": [
				"2 (20 ounce) cans jackfruit in brine - drained, rinsed, and cut into bite-sized pieces",
				"1 tablespoon vegetable oil",
				"1 tablespoon water, or more as needed",
				"2 tablespoons taco seasoning mix, or to taste",
				"4 taco shells",
				"1/2 cup salsa, or to taste"
			],
			"directions": "Heat oil in a small saucepan over medium heat. Add jackfruit; cook and stir for 2 to 3 minutes. Add 1 tablespoon water and taco seasoning; stir until well combined, about 1 minute. Add additional water 1 tablespoon at a time as needed. Place a small amount of jackfruit in each taco shell; add 2 tablespoons salsa."
		}
	]},

	{"italian": [
		{
			"recipe_name": "Salsiccia Piccante Pizza",
			"ingredients": [
				"1 1/2 teaspoons olive oil",
				"1/4 to 1/2 teaspoon crushed red pepper",
				"1 (4-ounce) link sweet turkey Italian sausage",
				"1/2 cup vertically sliced fennel bulb",
				"1/2 cup thinly vertically sliced red onion (about 1 small onion)",
				"1/4 teaspoon kosher salt",
				"2/3 cup chopped seeded tomato (about 2 tomatoes)",
				"1 (10-inch) Basic Pizza Dough",
				"1/4 cup (1 ounce) grated fresh Parmigiano-Reggiano cheese"
			],
			"directions": "Step 1 - Position an oven rack in lowest setting. Place a pizza stone on lowest rack. Step 2 - Preheat oven to 500. Preheat pizza stone 30 minutes before baking pizza. Step 3 - Heat oil in a large nonstick skillet over medium-high heat. Add pepper to pan; cook 10 seconds. Remove casings from sausage. Add sausage, fennel, and onion to pan; saute 4 minutes or until browned, stirring to crumble sausage. Stir in salt. Add tomato; saute 2 minutes or until tender. Remove from heat. Step 4 - Spread sausage mixture over Basic Pizza Dough, leaving a 1/2-inch border. Slide dough onto preheated pizza stone, using a spatula as a guide. Step 5 - Bake at 500 for 8 minutes or until crust is golden. Remove from pizza stone. Sprinkle with cheese. Cut pizza into 8 wedges."
		},

		{
			"recipe_name": "Spaghetti Carbonara",
			"ingredients": [
				"1 pound spaghetti",
				"1 tablespoon olive oil",
				"8 slices bacon, diced",
				"1 tablespoon olive oil",
				"1 onion, chopped",
				"1 clove garlic, minced",
				"1/4 cup dry white wine (optional)",
				"4 eggs",
				"1/2 cup grated Parmesan cheese",
				"1 pinch salt and black pepper to taste",
				"2 tablespoons chopped fresh parsley",
				"2 tablespoons grated Parmesan cheese"
			],
			"directions": "In a large pot of boiling salted water, cook spaghetti pasta until al dente. Drain well. Toss with 1 tablespoon of olive oil, and set aside. Meanwhile in a large skillet, cook chopped bacon until slightly crisp; remove and drain onto paper towels. Reserve 2 tablespoons of bacon fat; add remaining 1 tablespoon olive oil, and heat in reused large skillet. Add chopped onion, and cook over medium heat until onion is translucent. Add minced garlic, and cook 1 minute more. Add wine if desired; cook one more minute. Return cooked bacon to pan; add cooked and drained spaghetti. Toss to coat and heat through, adding more olive oil if it seems dry or is sticking together. Add beaten eggs and cook, tossing constantly with tongs or large fork until eggs are barely set. Quickly add 1/2 cup Parmesan cheese, and toss again. Add salt and pepper to taste (remember that bacon and Parmesan are very salty). Serve immediately with chopped parsley sprinkled on top, and extra Parmesan cheese at table."
		},

		{
			"recipe_name": "Lobster Ravioli",
			"ingredients": [
				"1/2 pound unpeeled large shrimp",
				"1 yellow onion, quartered",
				"2 stalks celery with leaves, cut into pieces",
				"1 lemon, halved",
				"1 tablespoon dried basil",
				"1 tablespoon dried oregano",
				"1 tablespoon dried thyme",
				"2 tablespoons whole black peppercorns",
				"1/2 cup chopped fresh flat-leaf parsley",
				"3 cups water",
				"1 tablespoon unsalted butter",
				"1 shallot, minced",
				"2 cloves garlic, minced",
				"2 teaspoons lemon zest",
				"1 teaspoon kosher salt",
				"1/4 teaspoon freshly ground black pepper",
				"1 cup white wine",
				"1 cup canned petite diced tomatoes",
				"1/2 cup heavy cream",
				"salt and freshly ground black pepper to taste",
				"16 lobster ravioli",
				"1 tablespoon chopped fresh flat-leaf parsley",
				"1 teaspoon lemon zest"
			],
			"directions": "Peel and devein the shrimp, reserving the shells and heads. Chop the shrimp into bite-size pieces. To make the shrimp stock, combine the shrimp shells and heads, onion, and celery in a large pot. Squeeze the lemon juice into the pot, then add the lemon halves as well. Add the dried basil, oregano, thyme, peppercorns, 1/2 cup parsley, and 3 cups of water. Cover the pot and bring to a boil. Reduce heat and simmer, uncovered, for 1 hour, skimming away any foam or impurities that have risen to the surface. Strain the shrimp stock and set aside. Heat the butter in a large skillet over medium heat. Cook the shrimp pieces until pink and almost cooked through, 1 to 2 minutes. Remove and set aside. Add the shallots to the pan; cook and stir until the shallots have softened and turned translucent, about 5 minutes. Stir in the garlic, lemon zest, salt, and ground pepper. Cook for thirty seconds, then add the white wine. Bring to a boil and cook until the white wine is reduced by half, about 5 minutes. Add the shrimp stock to the pan, bring it to a boil, and simmer until the sauce is reduce by half, about 15 minutes.  Meanwhile, fill a large pot with heavily salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in ravioli, and return to a boil. Cook uncovered, stirring occasionally, until the ravioli float to the top and the filling is hot, 3 to 4 minutes. Drain well, reserving a little pasta-cooking water to thin the sauce, if necessary. Stir the diced tomatoes and cream into the shrimp sauce and heat through. Return the shrimp to the pan, taste the sauce, and season to taste with salt and pepper. Fold the ravioli into the sauce. Place four ravioli onto each of four warmed pasta bowls or plates and top with sauce. Garnish the pasta with chopped parsley and lemon zest."
		},

		{
			"recipe_name": "Pollo Milanese",
			"ingredients": [
				"3 tablespoons flour",
				"3 medium eggs",
				"80g freshly grated Parmesan cheese",
				"60g dried breadcrumbs",
				"4 skinless chicken breasts",
				"4 tablespoons olive oil",
				"40g Parmesan cheese shavings",
				"3 tablespoons olive oil",
				"2 garlic cloves, peeled and sliced",
				"1 teaspoon dried chilli flakes",
				"2 x 400g tins of chopped tomatoes",
				"150g pitted black olives (preferably Gaeta or Leccino), drained",
				"400g fine green beans",
				"50ml extra virgin olive oil",
				"2 tablespoons white wine vinegar"
			],
			"directions": "First prepare the sauce. Heat the oil in a medium saucepan over a medium heat. Add the garlic. As soon as it starts to sizzle, add the chilli flakes and fry for 1 minute, stirring continually. Tip in the tomatoes and olives and bring to the boil. Reduce the heat and simmer for 20 minutes, uncovered, stirring occasionally. Season with salt. Set aside. Put the flour on a large plate or tray. Beat the eggs in a large bowl and season with salt. Combine the grated Parmesan and breadcrumbs in a shallow dish. Place the chicken breasts between 2 sheets of cling film. Using a rolling pin, meat mallet or heavy-based pan, pound the chicken to about 1 cm thick. Dip each chicken breast in the flour, then the eggs, then finally the breadcrumb mixture. Ensure each breast is evenly coated and press the breadcrumbs firmly into the egg so they stick. Heat the oil in a large frying over a medium heat. Add the chicken and fry for 4-5 minutes each side. Drain on kitchen paper. Keep warm. Meanwhile, plunge the beans into boiling water for 2-3 minutes or until al dente. Using a slotted spoon, transfer to a large bowl. While still warm, drizzle over the oil and vinegar, season well and toss to coat. Gently warm through the sauce over a low heat. Divide the sauce among 4 serving plates, then place the chicken breast on the sauce. Scatter over the Parmesan shaving. Serve the beans on the side." 
		},

		{
			"recipe_name": "Risotto Quattro Stagioni",
			"ingredients": [
				"6 cups chicken broth, divided",
				"3 tablespoons olive oil, divided",
				"1 pound portobello mushrooms, thinly sliced",
				"1 pound white mushrooms, thinly sliced",
				"2 shallots, diced",
				"1 1/2 cups Arborio rice",
				"1/2 cup dry white wine",
				"sea salt to taste",
				"freshly ground black pepper to taste",
				"3 tablespoons finely chopped chives",
				"4 tablespoons butter",
				"1/3 cup freshly grated Parmesan cheese"
			],
			"directions": "In a saucepan, warm the broth over low heat. Warm 2 tablespoons olive oil in a large saucepan over medium-high heat. Stir in the mushrooms, and cook until soft, about 3 minutes. Remove mushrooms and their liquid, and set aside. Add 1 tablespoon olive oil to skillet, and stir in the shallots. Cook 1 minute. Add rice, stirring to coat with oil, about 2 minutes. When the rice has taken on a pale, golden color, pour in wine, stirring constantly until the wine is fully absorbed. Add 1/2 cup broth to the rice, and stir until the broth is absorbed. Continue adding broth 1/2 cup at a time, stirring continuously, until the liquid is absorbed and the rice is al dente, about 15 to 20 minutes. Remove from heat, and stir in mushrooms with their liquid, butter, chives, and parmesan. Season with salt and pepper to taste."
		},

		{
			"recipe_name": "Tiramisu",
			"ingredients": [
				"6 egg yolks",
				"1 cup white sugar, divided",
				"1 pound mascarpone cheese",
				"6 egg whites, stiffly beaten",
				"1/4 cup heavy cream",
				"3 tablespoons kirschwasser",
				"1 1/4 cups strong brewed coffee, cold",
				"25 ladyfingers",
				"1 tablespoon unsweetened cocoa powder"
			],
			"directions": "In a medium bowl beat together the egg yolks and 1/3 cup of sugar. Using a wooden spoon stir in mascarpone cheese, beaten egg whites, cream and kirschwasser; stir until smooth. Set aside. Dissolve remaining 2/3 cup sugar in coffee. Quickly, to avoid complete saturation, dip ends of ladyfingers in coffee mixture. Place ladyfingers in a single layer in a 9 x 13 inch glass baking dish. Spread a layer of cheese mixture over the ladyfingers; repeat layers, ending with cheese mixture. Cover and refrigerate for several hours. Sprinkle with cocoa just before serving."
		}
	]},

	{"gluten-free": [
		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		}
	]},

	{"comfort": [
		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		}
	]},

	{"dairy-free": [
		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		}
	]},

	{"kid-friendly": [
		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		},

		{
			"recipe_name": "",
			"ingredients": [
				"",
				""
			],
			"directions": ""
		}
	]}
]}